<a href="https://colab.research.google.com/github/alexsandro-matias/lab_dio/blob/main/aula05_Trabalhando_com_Datas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Trabalhando com Datas

In [1]:
import pandas as pd

In [2]:
df1 = pd.read_excel("/content/Aracaju.xlsx")
df2 = pd.read_excel("/content/Fortaleza.xlsx")
df3 = pd.read_excel("/content/Natal.xlsx")
df4 = pd.read_excel("/content/Recife.xlsx")
df5 = pd.read_excel("/content/Salvador.xlsx")

In [3]:
df = pd.concat([df1,df2,df3,df4,df5])

In [15]:
df["Receita"] = df["Vendas"] * df["Qtde"]

In [16]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00    1520     1   142.00
1  Aracaju 2018-01-01   14.21    1522     6    85.26
2  Aracaju 2018-01-01   71.55    1520     1    71.55
3  Aracaju 2018-01-01    3.01    1521     7    21.07
4  Aracaju 2018-01-01   24.51    1522     8   196.08

In [7]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

Convertendo o campo **Data** para inteiro:

In [8]:
df["Data"] = df["Data"].astype("int64")

Verificando a alteração:

In [9]:
df.dtypes

Cidade     object
Data        int64
Vendas    float64
LojaID      int64
Qtde        int64
dtype: object

Convertendo o campo Data para o tipo datetime:

In [10]:
df["Data"] = pd.to_datetime(df["Data"])

Verificando a alteração:

In [11]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

A ideia de agrupamento também pode ocorrer por datas, neste caso o somatório da receitas por ano:

In [17]:
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    117925.13
2019    226712.03
Name: Receita, dtype: float64

Para criação da coluna **Ano** no dataframe:

In [18]:
df["Ano_Venda"] = df["Data"].dt.year

In [19]:
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde  Receita  Ano_Venda
235   Salvador 2019-01-03   41.84    1034     1    41.84       2019
25   Fortaleza 2019-01-01   80.31    1004     4   321.24       2019
65     Aracaju 2018-01-01  145.54    1522     3   436.62       2018
54       Natal 2018-10-03  373.00     852     4  1492.00       2018
53   Fortaleza 2019-01-01   11.48    1002     4    45.92       2019

Extraindo o **mês** e o **dia** do campo **Data**:

In [22]:
df["mes_venda"] , df["dia_venda"] = (df["Data"].dt.month , df["Data"].dt.day)

In [25]:
df.sample(5)

        Cidade       Data  Vendas  ...  Ano_Venda  mes_venda  dia_venda
232      Natal 2019-01-03  167.76  ...       2019          1          3
20       Natal 2018-06-08  608.00  ...       2018          6          8
46   Fortaleza 2019-01-01    6.45  ...       2019          1          1
85      Recife 2019-01-01  182.52  ...       2019          1          1
115    Aracaju 2018-01-01   50.99  ...       2018          1          1

[5 rows x 9 columns]

Retornando a compra mais antiga:

In [24]:
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

Calculando a diferença entre datas:

In [29]:
df["Diferenca_dias"] = df["Data"] - df["Data"].min()

In [30]:
df.sample(5)

       Cidade       Data  Vendas  ...  mes_venda  dia_venda  Diferenca_dias
157  Salvador 2019-01-02  150.17  ...          1          2        366 days
27    Aracaju 2018-01-01    3.39  ...          1          1          0 days
128    Recife 2019-03-02   38.70  ...          3          2        425 days
0       Natal 2018-08-27  606.00  ...          8         27        238 days
171     Natal 2019-01-02  136.45  ...          1          2        366 days

[5 rows x 10 columns]

Criando a tabela trimestre:

In [33]:
df["Semestre_venda"] = df["Data"].dt.quarter

In [38]:
df.rename(columns={"Semestre_venda": "Trimestre_venda"})

       Cidade       Data  Vendas  ...  dia_venda  Diferenca_dias  Trimestre_venda
0     Aracaju 2018-01-01  142.00  ...          1          0 days                1
1     Aracaju 2018-01-01   14.21  ...          1          0 days                1
2     Aracaju 2018-01-01   71.55  ...          1          0 days                1
3     Aracaju 2018-01-01    3.01  ...          1          0 days                1
4     Aracaju 2018-01-01   24.51  ...          1          0 days                1
..        ...        ...     ...  ...        ...             ...              ...
235  Salvador 2019-01-03   41.84  ...          3        367 days                1
236  Salvador 2019-01-03  126.29  ...          3        367 days                1
237  Salvador 2019-01-03   38.06  ...          3        367 days                1
238  Salvador 2019-01-03  139.64  ...          3        367 days                1
239  Salvador 2019-01-03  161.41  ...          3        367 days                1

[894 rows x 11 columns]

In [39]:
df.tail(10)

       Cidade       Data  Vendas  ...  dia_venda  Diferenca_dias  Semestre_venda
230  Salvador 2019-01-03  184.69  ...          3        367 days               1
231  Salvador 2019-01-03   89.85  ...          3        367 days               1
232  Salvador 2019-01-03  167.76  ...          3        367 days               1
233  Salvador 2019-01-03  172.40  ...          3        367 days               1
234  Salvador 2019-01-03   48.39  ...          3        367 days               1
235  Salvador 2019-01-03   41.84  ...          3        367 days               1
236  Salvador 2019-01-03  126.29  ...          3        367 days               1
237  Salvador 2019-01-03   38.06  ...          3        367 days               1
238  Salvador 2019-01-03  139.64  ...          3        367 days               1
239  Salvador 2019-01-03  161.41  ...          3        367 days               1

[10 rows x 11 columns]

Para filtrar as vendas de 2019 e no mês de Março:

In [46]:
vendas_marco_2019 = df.loc[((df["mes_venda"] == 3)) & (df["Ano_Venda"] == 2019)]

In [48]:
vendas_marco_2019.sample(15)

        Cidade       Data  Vendas  ...  dia_venda  Diferenca_dias  Semestre_venda
108     Recife 2019-03-02  152.89  ...          2        425 days               1
111  Fortaleza 2019-03-02    8.00  ...          2        425 days               1
136   Salvador 2019-03-02   13.81  ...          2        425 days               1
18       Natal 2019-03-14  581.00  ...         14        437 days               1
132  Fortaleza 2019-03-02   17.49  ...          2        425 days               1
129     Recife 2019-03-02   35.34  ...          2        425 days               1
141     Recife 2019-03-02  182.75  ...          2        425 days               1
46       Natal 2019-03-26  753.00  ...         26        449 days               1
116   Salvador 2019-03-02   41.78  ...          2        425 days               1
117  Fortaleza 2019-03-02   15.42  ...          2        425 days               1
122     Recife 2019-03-02  235.06  ...          2        425 days               1
119   Salvador 2019-03-02  136.37  ...          2        425 days               1
108   Salvador 2019-03-02   11.72  ...          2        425 days               1
69       Natal 2019-03-24  817.00  ...         24        447 days               1
71       Natal 2019-03-20  840.00  ...         20        443 days               1

[15 rows x 11 columns]